OpenFOAM-v2106/tutorials/heatTransfer/chtMultiRegionTwoPhaseEulerFoam/solidQuenching2D/0.orig/water/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 1;
    }

    symmetry
    {
        type            symmetry;
    }

    maxX
    {
        type            calculated;
        value           uniform 1;
    }

    minY
    {
        type            calculated;
        value           uniform 1;
    }

    empty
    {
        type            empty;
    }

    water_to_solid
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
